mslawicz/Zigbee_OnOff_Srv_Distrib/STM32_WPAN/App/app_zigbee.c
/* LevelControl server move_to_level 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_move_to_level(struct ZbZclClusterT *cluster, struct ZbZclLevelClientMoveToLevelReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 22 LevelControl server 1 move_to_level 1 */
	  uint8_t attrVal;
	  uint8_t endpoint;
	  uint8_t onOffVal;

	  if (ZbZclAttrRead(cluster, ZCL_LEVEL_ATTR_CURRLEVEL, NULL, &attrVal, sizeof(attrVal), false) != ZCL_STATUS_SUCCESS)
	  {
	    return ZCL_STATUS_FAILURE;
	  }

	  endpoint = ZbZclClusterGetEndpoint(cluster);
	  if (endpoint == SW1_ENDPOINT)
	  {
		RGB_params.level = req->level;
		APP_DBG("levelControl_server_1_move_to_level (level=%d)", RGB_params.level);
		(void)ZbZclAttrIntegerWrite(cluster, ZCL_LEVEL_ATTR_CURRLEVEL, RGB_params.level);

		// send data to LEDs if the device is on
		if(RGB_params.OnOff != 0)
		{
			RGB_LED_action(appTimer);
		}

		enum ZclDataTypeT* typePtr = NULL;
		enum ZclStatusCodeT* statusPtr = NULL;;
		onOffVal = ZbZclAttrIntegerRead(zigbee_app_info.onOff_server_1, ZCL_ONOFF_ATTR_ONOFF, typePtr, statusPtr);
		if((req->with_onoff) && (*statusPtr == ZCL_STATUS_SUCCESS))
		{
			//on/off action must be executed
			if((RGB_params.level <= 1) && (onOffVal != 0))
			{
				APP_DBG("levelControl_server_1_move_to_level calling onOff_server_1_off ");
				onOff_server_1_off(zigbee_app_info.onOff_server_1, srcInfo, arg);
			}
			if((RGB_params.level > 1) && (onOffVal == 0))
			{
				APP_DBG("levelControl_server_1_move_to_level calling onOff_server_1_on ");
				onOff_server_1_on(zigbee_app_info.onOff_server_1, srcInfo, arg);
			}
		}
	  }
	  else
	  {
	    /* Unknown endpoint */
	    return ZCL_STATUS_FAILURE;
	  }
	  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 22 LevelControl server 1 move_to_level 1 */
}

/* LevelControl server move 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_move(struct ZbZclClusterT *cluster, struct ZbZclLevelClientMoveReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 23 LevelControl server 1 move 1 */
	APP_DBG("levelControl_server_1_move");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 9 LevelControl server 1 move 1 */
}

/* LevelControl server step 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_step(struct ZbZclClusterT *cluster, struct ZbZclLevelClientStepReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 24 LevelControl server 1 step 1 */
	APP_DBG("levelControl_server_1_step");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 10 LevelControl server 1 step 1 */
}

/* LevelControl server stop 1 command callback */
static enum ZclStatusCodeT levelControl_server_1_stop(struct ZbZclClusterT *cluster, struct ZbZclLevelClientStopReqT *req, struct ZbZclAddrInfoT *srcInfo, void *arg)
{
  /* USER CODE BEGIN 25 LevelControl server 1 stop 1 */
	APP_DBG("levelControl_server_1_stop");
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 11 LevelControl server 1 stop 1 */
}

/* Window server up_command 1 command callback */
static enum ZclStatusCodeT window_server_1_up_command(struct ZbZclClusterT *cluster, struct ZbZclHeaderT *zclHdrPtr, struct ZbApsdeDataIndT *dataIndPtr, void *arg)
{
  /* USER CODE BEGIN 26 Window server 1 up_command 1 */
	APP_DBG("window_server_1_up_command");
	// execute action if the device is on
	if(RGB_params.OnOff != 0)
	{
		RGB_params.mode = (RGB_params.mode + 1) % No_Of_Modes;
		RGB_LED_action(appTimer);
	}
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 12 Window server 1 up_command 1 */
}

/* Window server down_command 1 command callback */
static enum ZclStatusCodeT window_server_1_down_command(struct ZbZclClusterT *cluster, struct ZbZclHeaderT *zclHdrPtr, struct ZbApsdeDataIndT *dataIndPtr, void *arg)
{
  /* USER CODE BEGIN 27 Window server 1 down_command 1 */
	APP_DBG("window_server_1_down_command");
	// execute action if the device is on
	if(RGB_params.OnOff != 0)
	{
		RGB_params.mode =  (RGB_params.mode == Mode_Static) ? (enum RGB_mode_t)(No_Of_Modes - 1) : (RGB_params.mode - 1);
		RGB_LED_action(appTimer);
	}
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 27 Window server 1 down_command 1 */
}

/* Window server set_lift_and_tilt_command 1 command callback */
static enum ZclStatusCodeT window_server_1_set_lift_and_tilt_command(struct ZbZclClusterT *cluster, void *arg, uint8_t liftPercentage, uint8_t tiltPercentage)
{
  /* USER CODE BEGIN 28 Window server 1 set_lift_and_tilt_command 1 */
	APP_DBG("window_server_1_set_lift_and_tilt_command (lift=%d, tilt=%d)", liftPercentage, tiltPercentage);
	if(RGB_params.OnOff != 0)
	{
		(void)ZbZclAttrIntegerWrite(cluster, ZCL_WNCV_SVR_ATTR_CURR_POS_LIFT_PERCENT, liftPercentage);
		(void)ZbZclAttrIntegerWrite(cluster, ZCL_WNCV_SVR_ATTR_CURR_POS_TILT_PERCENT, tiltPercentage);
	}
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 14 Window server 1 set_lift_and_tilt_command 1 */
}

/* Window server stop_command 1 command callback */
static enum ZclStatusCodeT window_server_1_stop_command(struct ZbZclClusterT *cluster, struct ZbZclHeaderT *zclHdrPtr, struct ZbApsdeDataIndT *dataIndPtr, void *arg)
{
  /* USER CODE BEGIN 29 Window server 1 stop_command 1 */
	APP_DBG("window_server_1_stop_command");
	// execute action if the device is on
	if(RGB_params.OnOff != 0)
	{
		RGB_params.mode = Mode_Static;
		RGB_LED_action(appTimer);
	}
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 15 Window server 1 stop_command 1 */
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Register task */
  /* Create the different tasks */
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_NOTIFY_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessNotifyM0ToM4);
  UTIL_SEQ_RegTask(1U << (uint32_t)CFG_TASK_REQUEST_FROM_M0_TO_M4, UTIL_SEQ_RFU, APP_ZIGBEE_ProcessRequestM0ToM4);

